README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. clasp-pip</a>
<ul>
<li><a href="#sec-1-1">1.1. Python</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. <code>fields_extract.py</code></a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. MATLAB</a></li>
<li><a href="#sec-1-3">1.3. Tecplot Macros</a></li>
</ul>
</li>
</ul>
</div>
</div>

# clasp-pip<a id="sec-1" name="sec-1"></a>

Miscellaneous space physics scripts in a variety of languages.

## Python<a id="sec-1-1" name="sec-1-1"></a>

### `fields_extract.py`<a id="sec-1-1-1" name="sec-1-1-1"></a>

Packages: tecplot, numpy, os

This script extracts a volume of electromagnetic field vectors from Tecplot data.
Change the values at the end of the file to select:
-   the limits of the volume
-   the resolution of the interpolated cartesian grid
-   the data to extract from

You can also change the equations which are applied to the data and the variables which are finally extracted.

## MATLAB<a id="sec-1-2" name="sec-1-2"></a>

## Tecplot Macros<a id="sec-1-3" name="sec-1-3"></a>